docs/org/index.org
#+title: Reitis Punktdateien
#+export_file_name: _index
#+PROPERTY: header-args :export_hugo_type homepage
#+hugo_tags: homepage

Henlo! Seems like you stumbled upon the documentation of my dotfiles, i.e. the configuration files for my Linux systems. Hope you find something you like!

* Components
My config roughly consists of the following parts:
1. *The OS.* I use [[https://endeavouros.com/][EndeavourOS]]. However, the only part where this is actually relevant is in the installation.
2. *Emacs*. I use [[https://github.com/doomemacs/doomemacs][Doom Emacs]]. This is not just an editor. My main use case is for all sorts of math/LaTeX stuff, including an elaborate note-taking setup using [[https://www.orgroam.com/][org-roam]]. Other than that, I use it to write these nice configs and docs, and occasionally do some programming.
3. *The Desktop Environment.*
   - Main ingredient is the window manager [[https://qtile.org/][Qtile]]. This is complimented by
   - [[https://github.com/yshui/picom][picom]] as the compositor,
   - [[https://github.com/davatorium/rofi][rofi]] as the application launcher,
   - [[https://github.com/dunst-project/dunst][dunst]] as the notification daemon, and
   - [[https://github.com/dylanaraps/pywal][pywal]] for some epic theming.
4. *The Terminal.* Featuring
   - [[https://fishshell.com/][fish]] as the shell, and
   - [[https://sw.kovidgoyal.net/kitty/][kitty]] as the terminal emulator.

** Deprecated Components
I also used and configured some other software previously. So there are old configs for them if you want to look at those, but I don't plan on improving these any further.
- [[https://www.vim.org/][vim]] (though I still use it for some quick file editing)
- [[https://i3wm.org/][i3]] + [[https://github.com/polybar/polybar][polybar]]
- [[https://awesomewm.org/][awesomewm]]
* Installation
The main reason I use Linux and all of this stuff is because I'm obsessed with customizing things. I therefore advocate you use my dotfiles as inspirations, stealing bits and pieces from them as you please.

If you do really want to /install/ some of my configs, I have an install script. However, *do not blindly run it*, and check first whether it won't do anything you don't want. It also relies on the pacman package manager, so it only works on Arch based distros. To run the script, first clone the git repo of my dotfiles using
#+begin_src bash
git clone --depth 1 https://github.com/FreakyByte/dotfiles
#+end_src
After that, executing =install.sh= will prompt you which parts of my config you want, install the relevant packages and symlink the relevant config files. Note that symlinking means the cloned repo can not be removed afterwards. If you want that, you have to copy the files yourself.

If you're using a stable release distribution like e.g. Ubuntu, keep in mind that the versions of programs in the official repos might be too old to work with these dotfiles. In this case, you'll have to manually build the newer packages yourself or use a [[https://help.ubuntu.com/community/PPA][PPA]] or something.
